kiffie/edc2svd/ci/regtest/PIC32MX274F256B.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ADC10</name>
      <description>ADC10 peripheral</description>
      <baseAddress>0xbf809000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x170</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>AD1CON1</name>
          <description>AD1CON1 register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DONE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SAMP</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ASAM</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CLRASAM</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SSRC</name>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>FORM</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CON1CLR</name>
          <description>AD1CON1CLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DONE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SAMP</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ASAM</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CLRASAM</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SSRC</name>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>FORM</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CON1SET</name>
          <description>AD1CON1SET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DONE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SAMP</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ASAM</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CLRASAM</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SSRC</name>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>FORM</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CON1INV</name>
          <description>AD1CON1INV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DONE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SAMP</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ASAM</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CLRASAM</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SSRC</name>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>FORM</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CON2</name>
          <description>AD1CON2 register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ALTS</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BUFM</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SMPI</name>
              <bitRange>[5:2]</bitRange>
            </field>
            <field>
              <name>BUFS</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CSCNA</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OFFCAL</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>VCFG</name>
              <bitRange>[15:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CON2CLR</name>
          <description>AD1CON2CLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ALTS</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BUFM</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SMPI</name>
              <bitRange>[5:2]</bitRange>
            </field>
            <field>
              <name>BUFS</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CSCNA</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OFFCAL</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>VCFG</name>
              <bitRange>[15:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CON2SET</name>
          <description>AD1CON2SET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ALTS</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BUFM</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SMPI</name>
              <bitRange>[5:2]</bitRange>
            </field>
            <field>
              <name>BUFS</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CSCNA</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OFFCAL</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>VCFG</name>
              <bitRange>[15:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CON2INV</name>
          <description>AD1CON2INV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ALTS</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BUFM</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SMPI</name>
              <bitRange>[5:2]</bitRange>
            </field>
            <field>
              <name>BUFS</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CSCNA</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OFFCAL</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>VCFG</name>
              <bitRange>[15:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CON3</name>
          <description>AD1CON3 register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCS</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>SAMC</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>ADRC</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CON3CLR</name>
          <description>AD1CON3CLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCS</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>SAMC</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>ADRC</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CON3SET</name>
          <description>AD1CON3SET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCS</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>SAMC</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>ADRC</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CON3INV</name>
          <description>AD1CON3INV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCS</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>SAMC</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>ADRC</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RESERVED1</name>
          <description>RESERVED1 register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
        </register>
        <register>
          <name>AD1CHS</name>
          <description>AD1CHS register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CH0SA</name>
              <bitRange>[21:16]</bitRange>
            </field>
            <field>
              <name>CH0NA</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CH0SB</name>
              <bitRange>[29:24]</bitRange>
            </field>
            <field>
              <name>CH0NB</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CHSCLR</name>
          <description>AD1CHSCLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CH0SA</name>
              <bitRange>[21:16]</bitRange>
            </field>
            <field>
              <name>CH0NA</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CH0SB</name>
              <bitRange>[29:24]</bitRange>
            </field>
            <field>
              <name>CH0NB</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CHSSET</name>
          <description>AD1CHSSET register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CH0SA</name>
              <bitRange>[21:16]</bitRange>
            </field>
            <field>
              <name>CH0NA</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CH0SB</name>
              <bitRange>[29:24]</bitRange>
            </field>
            <field>
              <name>CH0NB</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CHSINV</name>
          <description>AD1CHSINV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CH0SA</name>
              <bitRange>[21:16]</bitRange>
            </field>
            <field>
              <name>CH0NA</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CH0SB</name>
              <bitRange>[29:24]</bitRange>
            </field>
            <field>
              <name>CH0NB</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CSSL</name>
          <description>AD1CSSL register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CSSL0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CSSL1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CSSL2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CSSL3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CSSL4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CSSL5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CSSL9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CSSL10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CSSL11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CSSL13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CSSL14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CSSL15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CSSL17</name>
              <bitRange>[17:17]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CSSLCLR</name>
          <description>AD1CSSLCLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CSSL0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CSSL1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CSSL2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CSSL3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CSSL4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CSSL5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CSSL9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CSSL10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CSSL11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CSSL13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CSSL14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CSSL15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CSSL17</name>
              <bitRange>[17:17]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CSSLSET</name>
          <description>AD1CSSLSET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CSSL0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CSSL1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CSSL2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CSSL3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CSSL4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CSSL5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CSSL9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CSSL10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CSSL11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CSSL13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CSSL14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CSSL15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CSSL17</name>
              <bitRange>[17:17]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AD1CSSLINV</name>
          <description>AD1CSSLINV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CSSL0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CSSL1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CSSL2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CSSL3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CSSL4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CSSL5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CSSL9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CSSL10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CSSL11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CSSL13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CSSL14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CSSL15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CSSL17</name>
              <bitRange>[17:17]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUF0</name>
          <description>ADC1BUF0 register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUF0</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUF1</name>
          <description>ADC1BUF1 register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUF1</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUF2</name>
          <description>ADC1BUF2 register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUF2</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
