kiffie/edc2svd/ci/regtest/PIC32MX274F256B.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CMP3</name>
      <description>CMP3 peripheral</description>
      <baseAddress>0xbf80a020</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CM3CON</name>
          <description>CM3CON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>195</resetValue>
          <fields>
            <field>
              <name>CCH</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CREF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EVPOL</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>COUT</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CPOL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>COE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CM3CONCLR</name>
          <description>CM3CONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CCH</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CREF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EVPOL</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>COUT</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CPOL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>COE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CM3CONSET</name>
          <description>CM3CONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CCH</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CREF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EVPOL</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>COUT</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CPOL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>COE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CM3CONINV</name>
          <description>CM3CONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CCH</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CREF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EVPOL</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>COUT</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CPOL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>COE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CMP</name>
      <description>CMP peripheral</description>
      <baseAddress>0xbf80a060</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CMSTAT</name>
          <description>CMSTAT register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>C1OUT</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>C2OUT</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>C3OUT</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMSTATCLR</name>
          <description>CMSTATCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>C1OUT</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>C2OUT</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>C3OUT</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMSTATSET</name>
          <description>CMSTATSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>C1OUT</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>C2OUT</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>C3OUT</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMSTATINV</name>
          <description>CMSTATINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>C1OUT</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>C2OUT</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>C3OUT</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
