kiffie/edc2svd/ci/regtest/PIC32MX274F256B.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CTMU</name>
      <description>CTMU peripheral</description>
      <baseAddress>0xbf80a200</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTMUCON</name>
          <description>CTMUCON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IRNG</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ITRIM</name>
              <bitRange>[7:2]</bitRange>
            </field>
            <field>
              <name>CTTRIG</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IDISSEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>EDGSEQEN</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>EDGEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>TGEN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CTMUSIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>EDG2SEL</name>
              <bitRange>[21:18]</bitRange>
            </field>
            <field>
              <name>EDG2POL</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>EDG2MOD</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>EDG1STAT</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>EDG2STAT</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>EDG1SEL</name>
              <bitRange>[29:26]</bitRange>
            </field>
            <field>
              <name>EDG1POL</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>EDG1MOD</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTMUCONCLR</name>
          <description>CTMUCONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IRNG</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ITRIM</name>
              <bitRange>[7:2]</bitRange>
            </field>
            <field>
              <name>CTTRIG</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IDISSEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>EDGSEQEN</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>EDGEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>TGEN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CTMUSIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>EDG2SEL</name>
              <bitRange>[21:18]</bitRange>
            </field>
            <field>
              <name>EDG2POL</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>EDG2MOD</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>EDG1STAT</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>EDG2STAT</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>EDG1SEL</name>
              <bitRange>[29:26]</bitRange>
            </field>
            <field>
              <name>EDG1POL</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>EDG1MOD</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTMUCONSET</name>
          <description>CTMUCONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IRNG</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ITRIM</name>
              <bitRange>[7:2]</bitRange>
            </field>
            <field>
              <name>CTTRIG</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IDISSEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>EDGSEQEN</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>EDGEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>TGEN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CTMUSIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>EDG2SEL</name>
              <bitRange>[21:18]</bitRange>
            </field>
            <field>
              <name>EDG2POL</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>EDG2MOD</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>EDG1STAT</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>EDG2STAT</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>EDG1SEL</name>
              <bitRange>[29:26]</bitRange>
            </field>
            <field>
              <name>EDG1POL</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>EDG1MOD</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTMUCONINV</name>
          <description>CTMUCONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IRNG</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ITRIM</name>
              <bitRange>[7:2]</bitRange>
            </field>
            <field>
              <name>CTTRIG</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IDISSEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>EDGSEQEN</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>EDGEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>TGEN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CTMUSIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>EDG2SEL</name>
              <bitRange>[21:18]</bitRange>
            </field>
            <field>
              <name>EDG2POL</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>EDG2MOD</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>EDG1STAT</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>EDG2STAT</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>EDG1SEL</name>
              <bitRange>[29:26]</bitRange>
            </field>
            <field>
              <name>EDG1POL</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>EDG1MOD</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
