kiffie/edc2svd/ci/regtest/PIC32MX274F256B.svd
        <register>
          <name>IPC6CLR</name>
          <description>IPC6CLR register</description>
          <addressOffset>0xf4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSCMIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>FSCMIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>RTCCIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>RTCCIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>FCEIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>FCEIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CMP1IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CMP1IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC6SET</name>
          <description>IPC6SET register</description>
          <addressOffset>0xf8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSCMIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>FSCMIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>RTCCIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>RTCCIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>FCEIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>FCEIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CMP1IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CMP1IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC6INV</name>
          <description>IPC6INV register</description>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSCMIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>FSCMIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>RTCCIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>RTCCIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>FCEIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>FCEIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CMP1IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CMP1IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC7</name>
          <description>IPC7 register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMP2IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CMP2IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>CMP3IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CMP3IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>USBIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>USBIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>SPI1IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>SPI1IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC7CLR</name>
          <description>IPC7CLR register</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMP2IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CMP2IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>CMP3IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CMP3IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>USBIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>USBIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>SPI1IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>SPI1IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC7SET</name>
          <description>IPC7SET register</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMP2IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CMP2IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>CMP3IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CMP3IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>USBIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>USBIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>SPI1IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>SPI1IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC7INV</name>
          <description>IPC7INV register</description>
          <addressOffset>0x10c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMP2IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CMP2IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>CMP3IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CMP3IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>USBIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>USBIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>SPI1IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>SPI1IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC8</name>
          <description>IPC8 register</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U1IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>U1IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>I2C1IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>I2C1IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>CNIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>CNIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>PMPIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>PMPIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC8CLR</name>
          <description>IPC8CLR register</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U1IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>U1IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>I2C1IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>I2C1IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>CNIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>CNIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>PMPIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>PMPIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC8SET</name>
          <description>IPC8SET register</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U1IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>U1IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>I2C1IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>I2C1IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>CNIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>CNIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>PMPIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>PMPIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC8INV</name>
          <description>IPC8INV register</description>
          <addressOffset>0x11c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U1IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>U1IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>I2C1IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>I2C1IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>CNIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>CNIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>PMPIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>PMPIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC9</name>
          <description>IPC9 register</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPI2IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>SPI2IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>U2IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>U2IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>I2C2IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>I2C2IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CTMUIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CTMUIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC9CLR</name>
          <description>IPC9CLR register</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPI2IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>SPI2IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>U2IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>U2IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>I2C2IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>I2C2IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CTMUIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CTMUIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC9SET</name>
          <description>IPC9SET register</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPI2IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>SPI2IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>U2IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>U2IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>I2C2IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>I2C2IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CTMUIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CTMUIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC9INV</name>
          <description>IPC9INV register</description>
          <addressOffset>0x12c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPI2IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>SPI2IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>U2IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>U2IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>I2C2IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>I2C2IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CTMUIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CTMUIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC10</name>
          <description>IPC10 register</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMA0IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>DMA0IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>DMA1IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>DMA1IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>DMA2IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>DMA2IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>DMA3IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>DMA3IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC10CLR</name>
          <description>IPC10CLR register</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMA0IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>DMA0IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>DMA1IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>DMA1IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>DMA2IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>DMA2IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>DMA3IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>DMA3IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC10SET</name>
          <description>IPC10SET register</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMA0IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>DMA0IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>DMA1IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>DMA1IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>DMA2IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>DMA2IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>DMA3IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>DMA3IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC10INV</name>
          <description>IPC10INV register</description>
          <addressOffset>0x13c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMA0IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>DMA0IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>DMA1IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>DMA1IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>DMA2IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>DMA2IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>DMA3IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>DMA3IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
