kiffie/edc2svd/ci/regtest/PIC32MX274F256B.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DMAC</name>
      <description>DMAC peripheral</description>
      <baseAddress>0xbf883000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x60</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DMACON</name>
          <description>DMACON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMABUSY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SUSPEND</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACONCLR</name>
          <description>DMACONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMABUSY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SUSPEND</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACONSET</name>
          <description>DMACONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMABUSY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SUSPEND</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACONINV</name>
          <description>DMACONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMABUSY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SUSPEND</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMASTAT</name>
          <description>DMASTAT register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMACH</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>RDWR</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMASTATCLR</name>
          <description>DMASTATCLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMACH</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>RDWR</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMASTATSET</name>
          <description>DMASTATSET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMACH</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>RDWR</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMASTATINV</name>
          <description>DMASTATINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMACH</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>RDWR</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAADDR</name>
          <description>DMAADDR register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMAADDR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAADDRCLR</name>
          <description>DMAADDRCLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMAADDR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAADDRSET</name>
          <description>DMAADDRSET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMAADDR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAADDRINV</name>
          <description>DMAADDRINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMAADDR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCRCCON</name>
          <description>DCRCCON register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CRCCH</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>CRCTYP</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CRCAPP</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CRCEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PLEN</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>BITO</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>WBO</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>BYTO</name>
              <bitRange>[29:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCRCCONCLR</name>
          <description>DCRCCONCLR register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CRCCH</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>CRCTYP</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CRCAPP</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CRCEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PLEN</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>BITO</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>WBO</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>BYTO</name>
              <bitRange>[29:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCRCCONSET</name>
          <description>DCRCCONSET register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CRCCH</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>CRCTYP</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CRCAPP</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CRCEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PLEN</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>BITO</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>WBO</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>BYTO</name>
              <bitRange>[29:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCRCCONINV</name>
          <description>DCRCCONINV register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CRCCH</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>CRCTYP</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CRCAPP</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CRCEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PLEN</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>BITO</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>WBO</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>BYTO</name>
              <bitRange>[29:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCRCDATA</name>
          <description>DCRCDATA register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DCRCDATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCRCDATACLR</name>
          <description>DCRCDATACLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DCRCDATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCRCDATASET</name>
          <description>DCRCDATASET register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DCRCDATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCRCDATAINV</name>
          <description>DCRCDATAINV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DCRCDATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCRCXOR</name>
          <description>DCRCXOR register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DCRCXOR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCRCXORCLR</name>
          <description>DCRCXORCLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DCRCXOR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCRCXORSET</name>
          <description>DCRCXORSET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DCRCXOR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCRCXORINV</name>
          <description>DCRCXORINV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DCRCXOR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
