kiffie/edc2svd/ci/regtest/PIC32MX274F256B.svd
        <register>
          <name>U1EP5SET</name>
          <description>U1EP5SET register</description>
          <addressOffset>0x318</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP5INV</name>
          <description>U1EP5INV register</description>
          <addressOffset>0x31c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP6</name>
          <description>U1EP6 register</description>
          <addressOffset>0x320</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP6CLR</name>
          <description>U1EP6CLR register</description>
          <addressOffset>0x324</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP6SET</name>
          <description>U1EP6SET register</description>
          <addressOffset>0x328</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP6INV</name>
          <description>U1EP6INV register</description>
          <addressOffset>0x32c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP7</name>
          <description>U1EP7 register</description>
          <addressOffset>0x330</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP7CLR</name>
          <description>U1EP7CLR register</description>
          <addressOffset>0x334</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP7SET</name>
          <description>U1EP7SET register</description>
          <addressOffset>0x338</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP7INV</name>
          <description>U1EP7INV register</description>
          <addressOffset>0x33c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP8</name>
          <description>U1EP8 register</description>
          <addressOffset>0x340</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP8CLR</name>
          <description>U1EP8CLR register</description>
          <addressOffset>0x344</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP8SET</name>
          <description>U1EP8SET register</description>
          <addressOffset>0x348</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP8INV</name>
          <description>U1EP8INV register</description>
          <addressOffset>0x34c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP9</name>
          <description>U1EP9 register</description>
          <addressOffset>0x350</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP9CLR</name>
          <description>U1EP9CLR register</description>
          <addressOffset>0x354</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP9SET</name>
          <description>U1EP9SET register</description>
          <addressOffset>0x358</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP9INV</name>
          <description>U1EP9INV register</description>
          <addressOffset>0x35c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP10</name>
          <description>U1EP10 register</description>
          <addressOffset>0x360</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP10CLR</name>
          <description>U1EP10CLR register</description>
          <addressOffset>0x364</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP10SET</name>
          <description>U1EP10SET register</description>
          <addressOffset>0x368</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP10INV</name>
          <description>U1EP10INV register</description>
          <addressOffset>0x36c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP11</name>
          <description>U1EP11 register</description>
          <addressOffset>0x370</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP11CLR</name>
          <description>U1EP11CLR register</description>
          <addressOffset>0x374</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP11SET</name>
          <description>U1EP11SET register</description>
          <addressOffset>0x378</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP11INV</name>
          <description>U1EP11INV register</description>
          <addressOffset>0x37c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U1EP12</name>
          <description>U1EP12 register</description>
          <addressOffset>0x380</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EPHSHK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EPSTALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EPTXEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EPRXEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EPCONDIS</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
