kiffie/edc2svd/ci/regtest/PIC32MX274F256B.svd
        <register>
          <name>LATBINV</name>
          <description>LATBINV register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LATB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>LATB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>LATB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCB</name>
          <description>ODCB register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ODCB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCBCLR</name>
          <description>ODCBCLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ODCB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCBSET</name>
          <description>ODCBSET register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ODCB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCBINV</name>
          <description>ODCBINV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ODCB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUB</name>
          <description>CNPUB register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPUB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUBCLR</name>
          <description>CNPUBCLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPUB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUBSET</name>
          <description>CNPUBSET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPUB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUBINV</name>
          <description>CNPUBINV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPUB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDB</name>
          <description>CNPDB register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPDB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDBCLR</name>
          <description>CNPDBCLR register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPDB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDBSET</name>
          <description>CNPDBSET register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPDB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDBINV</name>
          <description>CNPDBINV register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPDB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONB</name>
          <description>CNCONB register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONBCLR</name>
          <description>CNCONBCLR register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONBSET</name>
          <description>CNCONBSET register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
